# vi: set ft=ruby

tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'

tap 'caskroom/cask'
tap 'rockymadden/rockymadden'
tap 'stuarthicks/brews'
tap 'zzrotdesign/tap'

brew 'autoconf'
brew 'automake'
brew 'autossh'
brew 'bash'
brew 'boost'
brew 'cairo'
brew 'circleci-cli'
brew 'clang-format'
brew 'cmake'
brew 'colordiff'
brew 'coreutils', args: [ 'with-gmp' ]
brew 'ctags'
brew 'cunit'
brew 'curl', args: [ 'with-openssl', 'with-nghttp2', 'with-rtmpdump' ]
brew 'docker-clean'
brew 'editorconfig'
brew 'faad2'
brew 'fdk-aac'
brew 'ffmpeg', args: [ 'with-fdk-aac', 'with-freetype' ]
brew 'figlet'
brew 'fluid-synth'
brew 'fontconfig'
brew 'freetype'
brew 'gdb'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'git-lfs'
brew 'glib'
brew 'gnu-sed', args: [ 'with-default-names' ]
brew 'gobject-introspection'
brew 'gradle'
brew 'graphviz'
brew 'htop-osx'
brew 'httpie'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'jansson'
brew 'jemalloc'
brew 'jpeg'
brew 'jq'
brew 'lame'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libid3tag'
brew 'libmpdclient'
brew 'libpng'
brew 'libressl'
brew 'libsamplerate'
brew 'libtiff'
brew 'libtool'
brew 'libxml2'
brew 'lolcat'
brew 'lua'
brew 'make'
brew 'makedepend'
brew 'maven'
brew 'media-info'
brew 'mobile-shell'
brew 'mpc'
brew 'mpd', restart_service: :changed
brew 'mtr'
brew 'ncmpcpp'
brew 'nghttp2'
brew 'ngrep'
brew 'nmap'
brew 'oniguruma'
brew 'openssh', args: [ 'with-openssl' ]
brew 'openssl'
brew 'p7zip'
brew 'pcre'
brew 'perl-build'
brew 'pixman'
brew 'pkg-config'
brew 'protobuf'
brew 'pstree'
brew 'pv'
brew 'pyenv'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'rbenv-bundler'
brew 'rbenv-bundler-ruby-version'
brew 'rbenv-ctags'
brew 'rbenv-default-gems'
brew 'rbenv-use'
brew 'rbenv-whatis'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redsocks'
brew 'rtmpdump'
brew 'ruby-build'
brew 'ruby-install'
brew 'sbt'
brew 'scons'
brew 'shared-mime-info'
brew 'sl'
brew 'spdylay'
brew 'sphinx-doc'
brew 'sqlite'
brew 'srm'
brew 'ssh-copy-id'
brew 'sshrc'
brew 'sslyze'
brew 'stow'
brew 'taglib'
brew 'terminal-notifier'
brew 'texi2html'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'tsocks', args: [ 'HEAD' ]
brew 'tstools'
brew 'unrar'
brew 'urlview'
brew 'utf8proc'
brew 'watch'
brew 'wget'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'yank'
brew 'yasm'
brew 'zsh'

brew 'https://gist.github.com/mitukiii/9029870/raw/rbenv-each.rb', args: [ 'HEAD' ]

cask 'aerial'
