# vi: set ft=ruby sw=2 ts=2 expandtab :
# frozen_string_literal: true

tap 'fastly/tap'
brew 'fastly/tap/fastly'

tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform'

tap 'soldiermoth/tap'
brew 'soldiermoth/tap/hlsq'

tap 'stuarthicks/tap'
brew 'stuarthicks/tap/access_key_manager'
brew 'stuarthicks/tap/oauth2_token'
brew 'stuarthicks/tap/presign-s3-url'
brew 'stuarthicks/tap/rextract'
brew 'stuarthicks/tap/tid'
brew 'stuarthicks/tap/tls_cert_info'
brew 'stuarthicks/tap/tstools'

tap 'wader/tap'
brew 'wader/tap/fq'

tap 'ynqa/tap'
brew 'ynqa/tap/jnv'

tap 'goreleaser/tap'
brew 'goreleaser/tap/goreleaser'

tap 'jfryy/tap'
brew 'jfryy/tap/qq'

tap 'neilotoole/sq'
brew 'neilotoole/sq/sq'

tap 'rsteube/tap'
brew 'rsteube/tap/carapace'

tap 'owenthereal/upterm'
brew 'owenthereal/upterm/upterm'

# Homebrew Core
brew 'bento4'
brew 'cidr'
brew 'circleci'
brew 'csvq'
brew 'd2'
brew 'doggo'
brew 'fastgron'
brew 'fx'
brew 'fzy'
brew 'glow'
brew 'go'
brew 'jaq'
brew 'jnv'
brew 'k9s'
brew 'lazygit'
brew 'libyaml'
brew 'magic-wormhole'
brew 'mise'
brew 'neovide'
brew 'prettier'
brew 'shush'
brew 'starship'
brew 'tflint'
brew 'tlrc'
brew 'tsduck'
brew 'tzdiff'
brew 'urlview'
brew 'xsv'
brew 'yq'
brew 'yt-dlp'
brew 'zellij'

if OS.mac?
  tap 'homebrew-ffmpeg/ffmpeg'
  brew 'homebrew-ffmpeg/ffmpeg/ffmpeg'

  # Homebrew Core
  brew 'automake'
  brew 'awscli'
  brew 'bash'
  brew 'bat'
  brew 'cmake'
  brew 'coreutils'
  brew 'curl'
  brew 'diff-so-fancy'
  brew 'difftastic'
  brew 'fd'
  brew 'fzf'
  brew 'gh'
  brew 'git'
  brew 'git-lfs'
  brew 'gotags'
  brew 'groff'
  brew 'imagemagick'
  brew 'jo'
  brew 'jq'
  brew 'just'
  brew 'kubectl'
  brew 'libiconv'
  brew 'libtool'
  brew 'macos-trash'
  brew 'make'
  brew 'mas'
  brew 'mediainfo'
  brew 'neovim'
  brew 'opentofu'
  brew 'pv'
  brew 'ripgrep'
  brew 'sslscan'
  brew 'stow'
  brew 'terraform'
  brew 'tig'
  brew 'tmate'
  brew 'tmux'
  brew 'trurl'
  brew 'universal-ctags'
  brew 'xq'
  brew 'zoxide'

  tap '1password/tap'
  cask '1password-cli'

  tap 'jandedobbeleer/oh-my-posh'
  cask 'jandedobbeleer/oh-my-posh/oh-my-posh'

  cask 'alacritty'
  cask 'git-credential-manager'
  cask 'powershell'
end

if OS.linux?
  brew 'swift'

  tap 'jandedobbeleer/oh-my-posh'
  brew 'jandedobbeleer/oh-my-posh/oh-my-posh'
end
